spec/data/stripe/subscription_list.json

{
  "object": "list",
  "url": "/v1/subscriptions",
  "has_more": false,
  "data": [
    {
      "id": "su_1JedlQ2eZvKYlo2CDlNe3ElW",
      "object": "subscription",
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false
      },
      "billing_cycle_anchor": 1634035339,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1632825739,
      "current_period_end": 1646736139,
      "current_period_start": 1644921739,
      "customer": "cus_KJGH9Y00fwV3uE",
      "days_until_due": null,
      "default_payment_method": "pm_1JedlN2eZvKYlo2CSQoo8hHc",
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_KJGI8rGwEcwlVU",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1632825740,
            "metadata": {},
            "price": {
              "id": "15",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1386685951,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {
                "charset": "utf-8",
                "content": "15"
              },
              "nickname": null,
              "product": "prod_BTdpcRLIUTfsFR",
              "recurring": {
                "aggregate_usage": null,
                "interval": "week",
                "interval_count": 3,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 444,
              "unit_amount_decimal": "444"
            },
            "quantity": 1,
            "subscription": "sub_1JedlQ2eZvKYlo2Cmc9TYNhw",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "url": "/v1/subscription_items?subscription=sub_1JedlQ2eZvKYlo2Cmc9TYNhw"
      },
      "latest_invoice": "in_1KTOV62eZvKYlo2CD2iQkrAD",
      "livemode": false,
      "metadata": {
        "order_id": "6735"
      },
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "schedule": null,
      "start_date": 1632825739,
      "status": "active",
      "transfer_data": null,
      "trial_end": 1634035339,
      "trial_start": 1632825739
    },
    {
      "id": "su_4444lQ2eZvKYlo2CDlNe3EEEE",
      "object": "subscription",
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false
      },
      "billing_cycle_anchor": 1634035339,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1632825739,
      "current_period_end": 1646736139,
      "current_period_start": 1644921739,
      "customer": "cus_KJGH9Y00fwV3uE",
      "days_until_due": null,
      "default_payment_method": "pm_1JedlN2eZvKYlo2CSQoo8hHc",
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_KJGI8rGwEcwlVU",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1632825740,
            "metadata": {},
            "price": {
              "id": "15",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1386685951,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {
                "charset": "utf-8",
                "content": "15"
              },
              "nickname": null,
              "product": "prod_BTdpcRLIUTfsFR",
              "recurring": {
                "aggregate_usage": null,
                "interval": "week",
                "interval_count": 3,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 444,
              "unit_amount_decimal": "444"
            },
            "quantity": 1,
            "subscription": "sub_1JedlQ2eZvKYlo2Cmc9TYNhw",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "url": "/v1/subscription_items?subscription=sub_1JedlQ2eZvKYlo2Cmc9TYNhw"
      },
      "latest_invoice": "in_1KTOV62eZvKYlo2CD2iQkrAD",
      "livemode": false,
      "metadata": {
        "order_id": "6735"
      },
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "schedule": null,
      "start_date": 1632825739,
      "status": "active",
      "transfer_data": null,
      "trial_end": 1634035339,
      "trial_start": 1632825739
    }
  ]
}